#Generated by Fabric Compiler ( version 2020.1-SP1 <build 55403> ) at Tue Apr 21 13:56:04 2020

add_design "I:/demo_pg2l100h/hdmi_loop/source/hdmi_loop.v"
add_design "I:/demo_pg2l100h/hdmi_loop/source/lut_hdmi.v"
add_design "I:/demo_pg2l100h/hdmi_loop/source/i2c_master/i2c_config.v"
add_design "I:/demo_pg2l100h/hdmi_loop/source/i2c_master/i2c_master_bit_ctrl.v"
add_design "I:/demo_pg2l100h/hdmi_loop/source/i2c_master/i2c_master_byte_ctrl.v"
add_design "I:/demo_pg2l100h/hdmi_loop/source/i2c_master/i2c_master_top.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile 
add_constraint "I:/demo_pg2l100h/hdmi_loop/hdmi_loop.fdc"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile 
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
synthesize -synplify_pro -selected_syn_tool_opt 1 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design E:/axp100/demo/hdmi_loop/ipcore/sys_pll/sys_pll.idf
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
remove_constraint "E:/axp100/demo/hdmi_loop/device_map/hdmi_loop.pcf"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "E:/axp100/demo/hdmi_loop/source/sys_reset_n.v"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_constraint "E:/axp100/demo/hdmi_loop/device_map/hdmi_loop.pcf"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_fic "E:/axp100/demo/hdmi_loop/synthesize/hdmi_loop_syn.fic"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "D:/ZiGuang/Final/source/Top_Project.v"
add_design "D:/ZiGuang/Final/source/algorithm_down.v"
add_design "D:/ZiGuang/Final/source/algorithm_left.v"
add_design "D:/ZiGuang/Final/source/algorithm_up.v"
add_design "D:/ZiGuang/Final/source/algorithm_right.v"
add_design "D:/ZiGuang/Final/source/Right_Up_FIFO_control.v"
add_design "D:/ZiGuang/Final/source/RGB_control_Top.v"
add_design "D:/ZiGuang/Final/source/Left_Down_FIFO_control.v"
add_design "D:/ZiGuang/Final/source/GetMax.v"
add_design "D:/ZiGuang/Final/source/GetMin.v"
add_design "D:/ZiGuang/Final/source/Send_24Bit.v"
add_design "D:/ZiGuang/Final/source/RGB_Wave.v"
add_design D:/ZiGuang/Final/ipcore/Down_FIFO/Down_FIFO.idf
add_design D:/ZiGuang/Final/ipcore/Left_FIFO/Left_FIFO.idf
add_design D:/ZiGuang/Final/ipcore/Up_FIFO/Up_FIFO.idf
add_design D:/ZiGuang/Final/ipcore/Right_FIFO/Right_FIFO.idf
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
report_power 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hdmi_loop
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr -gplace_seed 1 -mode {performance} -optimize_multi_corner_timing -optimize_gp_recovery -optimize_dp_recovery -optimize_rp_recovery 
report_timing 
gen_netlist 
report_power 
